zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_timer.h
/*!
    \file    gd32c2x1_timer.h
    \brief   definitions for the TIMER

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_TIMER_H
#define GD32C2X1_TIMER_H

#include "gd32c2x1.h"

/* TIMERx(x=0,2,13,15,16) definitions */
#define TIMER0                           (TIMER_BASE + 0x00012C00U)
#define TIMER2                           (TIMER_BASE + 0x00000400U)
#define TIMER13                          (TIMER_BASE + 0x00002000U)
#define TIMER15                          (TIMER_BASE + 0x00014400U)
#define TIMER16                          (TIMER_BASE + 0x00014800U)

/* registers definitions */
#define TIMER_CTL0(timerx)               REG32((timerx) + 0x00U)                                    /*!< TIMER control register 0 */
#define TIMER_CTL1(timerx)               REG32((timerx) + 0x04U)                                    /*!< TIMER control register 1 */
#define TIMER_SMCFG(timerx)              REG32((timerx) + 0x08U)                                    /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN(timerx)           REG32((timerx) + 0x0CU)                                    /*!< TIMER DMA and interrupt enable register */
#define TIMER_INTF(timerx)               REG32((timerx) + 0x10U)                                    /*!< TIMER interrupt flag register */
#define TIMER_SWEVG(timerx)              REG32((timerx) + 0x14U)                                    /*!< TIMER software event generation register */
#define TIMER_CHCTL0(timerx)             REG32((timerx) + 0x18U)                                    /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1(timerx)             REG32((timerx) + 0x1CU)                                    /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2(timerx)             REG32((timerx) + 0x20U)                                    /*!< TIMER channel control register 2 */
#define TIMER_CNT(timerx)                REG32((timerx) + 0x24U)                                    /*!< TIMER counter register */
#define TIMER_PSC(timerx)                REG32((timerx) + 0x28U)                                    /*!< TIMER prescaler register */
#define TIMER_CAR(timerx)                REG32((timerx) + 0x2CU)                                    /*!< TIMER counter auto reload register */
#define TIMER_CREP(timerx)               REG32((timerx) + 0x30U)                                    /*!< TIMER counter repetition register */
#define TIMER_CH0CV(timerx)              REG32((timerx) + 0x34U)                                    /*!< TIMER channel 0 capture/compare value register */
#define TIMER_CH1CV(timerx)              REG32((timerx) + 0x38U)                                    /*!< TIMER channel 1 capture/compare value register */
#define TIMER_CH2CV(timerx)              REG32((timerx) + 0x3CU)                                    /*!< TIMER channel 2 capture/compare value register */
#define TIMER_CH3CV(timerx)              REG32((timerx) + 0x40U)                                    /*!< TIMER channel 3 capture/compare value register */
#define TIMER_CCHP(timerx)               REG32((timerx) + 0x44U)                                    /*!< TIMER complementary channel protection register */
#define TIMER_DMACFG(timerx)             REG32((timerx) + 0x48U)                                    /*!< TIMER DMA configuration register */
#define TIMER_DMATB(timerx)              REG32((timerx) + 0x4CU)                                    /*!< TIMER DMA transfer buffer register */
#define TIMER_CHCTL3(timerx)             REG32((timerx) + 0x54U)                                    /*!< TIMER channel control register 3 */
#define TIMER_CH4CV(timerx)              REG32((timerx) + 0x58U)                                    /*!< TIMER channel 4 capture/compare value register */
#define TIMER_AFCTL0(timerx)             REG32((timerx) + 0x60U)                                    /*!< TIMER alternate function control register 0 */
#define TIMER_AFCTL1(timerx)             REG32((timerx) + 0x64U)                                    /*!< TIMER alternate function control register 1 */
#define TIMER_INSEL(timerx)              REG32((timerx) + 0x68U)                                    /*!< TIMER input selection register */
#define TIMER_CFG(timerx)                REG32((timerx) + 0xFCU)                                    /*!< TIMER configuration register */

/* bits definitions */
/* TIMER_CTL0 */
#define TIMER_CTL0_CEN                   BIT(0)                                                     /*!< TIMER counter enable */
#define TIMER_CTL0_UPDIS                 BIT(1)                                                     /*!< update disable */
#define TIMER_CTL0_UPS                   BIT(2)                                                     /*!< update source */
#define TIMER_CTL0_SPM                   BIT(3)                                                     /*!< single pulse mode */
#define TIMER_CTL0_DIR                   BIT(4)                                                     /*!< timer counter direction */
#define TIMER_CTL0_CAM                   BITS(5,6)                                                  /*!< center-aligned mode selection */
#define TIMER_CTL0_ARSE                  BIT(7)                                                     /*!< auto-reload shadow enable */
#define TIMER_CTL0_CKDIV                 BITS(8,9)                                                  /*!< clock division */

/* TIMER_CTL1 */
#define TIMER_CTL1_CCSE                  BIT(0)                                                     /*!< commutation control shadow enable */
#define TIMER_CTL1_CCUC                  BIT(2)                                                     /*!< commutation control shadow register update control */
#define TIMER_CTL1_DMAS                  BIT(3)                                                     /*!< DMA request source selection */
#define TIMER_CTL1_MMC                   BITS(4,6)                                                  /*!< master mode control */
#define TIMER_CTL1_TI0S                  BIT(7)                                                     /*!< channel 0 trigger input selection(hall mode selection) */
#define TIMER_CTL1_ISO0                  BIT(8)                                                     /*!< idle state of channel 0 output */
#define TIMER_CTL1_ISO0N                 BIT(9)                                                     /*!< idle state of channel 0 complementary output */
#define TIMER_CTL1_ISO1                  BIT(10)                                                    /*!< idle state of channel 1 output */
#define TIMER_CTL1_ISO1N                 BIT(11)                                                    /*!< idle state of channel 1 complementary output */
#define TIMER_CTL1_ISO2                  BIT(12)                                                    /*!< idle state of channel 2 output */
#define TIMER_CTL1_ISO2N                 BIT(13)                                                    /*!< idle state of channel 2 complementary output */
#define TIMER_CTL1_ISO3                  BIT(14)                                                    /*!< idle state of channel 3 output */
#define TIMER_CTL1_ISO4                  BIT(16)                                                    /*!< idle state of channel 4 output */

/* TIMER_SMCFG */
#define TIMER_SMCFG_MSM                  BIT(7)                                                     /*!< master-slave mode */
#define TIMER_SMCFG_ETFC                 BITS(8,11)                                                 /*!< external trigger filter control */
#define TIMER_SMCFG_ETPSC                BITS(12,13)                                                /*!< external trigger prescaler */
#define TIMER_SMCFG_SMC1                 BIT(14)                                                    /*!< part of SMC for enable external clock mode 1 */
#define TIMER_SMCFG_ETP                  BIT(15)                                                    /*!< external trigger polarity */

/* TIMER_DMAINTEN */
#define TIMER_DMAINTEN_UPIE              BIT(0)                                                     /*!< update interrupt enable */
#define TIMER_DMAINTEN_CH0IE             BIT(1)                                                     /*!< channel 0 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH1IE             BIT(2)                                                     /*!< channel 1 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH2IE             BIT(3)                                                     /*!< channel 2 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CH3IE             BIT(4)                                                     /*!< channel 3 capture/compare interrupt enable */
#define TIMER_DMAINTEN_CMTIE             BIT(5)                                                     /*!< commutation interrupt request enable */
#define TIMER_DMAINTEN_TRGIE             BIT(6)                                                     /*!< trigger interrupt enable */
#define TIMER_DMAINTEN_BRKIE             BIT(7)                                                     /*!< break interrupt enable */
#define TIMER_DMAINTEN_UPDEN             BIT(8)                                                     /*!< update DMA request enable */
#define TIMER_DMAINTEN_CH0DEN            BIT(9)                                                     /*!< channel 0 capture/compare DMA request enable */
#define TIMER_DMAINTEN_CH1DEN            BIT(10)                                                    /*!< channel 1 capture/compare DMA request enable */
#define TIMER_DMAINTEN_CH2DEN            BIT(11)                                                    /*!< channel 2 capture/compare DMA request enable */
#define TIMER_DMAINTEN_CH3DEN            BIT(12)                                                    /*!< channel 3 capture/compare DMA request enable */
#define TIMER_DMAINTEN_CMTDEN            BIT(13)                                                    /*!< commutation DMA request enable */
#define TIMER_DMAINTEN_TRGDEN            BIT(14)                                                    /*!< trigger DMA request enable */

/* TIMER_INTF */
#define TIMER_INTF_UPIF                  BIT(0)                                                     /*!< update interrupt flag */
#define TIMER_INTF_CH0IF                 BIT(1)                                                     /*!< channel 0 capture/compare interrupt flag */
#define TIMER_INTF_CH1IF                 BIT(2)                                                     /*!< channel 1 capture/compare interrupt flag */
#define TIMER_INTF_CH2IF                 BIT(3)                                                     /*!< channel 2 capture/compare interrupt flag */
#define TIMER_INTF_CH3IF                 BIT(4)                                                     /*!< channel 3 capture/compare interrupt flag */
#define TIMER_INTF_CMTIF                 BIT(5)                                                     /*!< channel commutation interrupt flag */
#define TIMER_INTF_TRGIF                 BIT(6)                                                     /*!< trigger interrupt flag */
#define TIMER_INTF_BRK0IF                BIT(7)                                                     /*!< break 0 interrupt flag */
#define TIMER_INTF_BRK1IF                BIT(8)                                                     /*!< break 1 interrupt flag */
#define TIMER_INTF_CH0OF                 BIT(9)                                                     /*!< channel 0 overcapture flag */
#define TIMER_INTF_CH1OF                 BIT(10)                                                    /*!< channel 1 overcapture flag */
#define TIMER_INTF_CH2OF                 BIT(11)                                                    /*!< channel 2 overcapture flag */
#define TIMER_INTF_CH3OF                 BIT(12)                                                    /*!< channel 3 overcapture flag */
#define TIMER_INTF_SYSBIF                BIT(13)                                                    /*!< System source break interrupt flag */
#define TIMER_INTF_CH4IF                 BIT(16)                                                    /*!< channel 4 compare interrupt flag */
/* TIMER_SWEVG */
#define TIMER_SWEVG_UPG                  BIT(0)                                                     /*!< update event generate */
#define TIMER_SWEVG_CH0G                 BIT(1)                                                     /*!< channel 0 capture or compare event generation */
#define TIMER_SWEVG_CH1G                 BIT(2)                                                     /*!< channel 1 capture or compare event generation */
#define TIMER_SWEVG_CH2G                 BIT(3)                                                     /*!< channel 2 capture or compare event generation */
#define TIMER_SWEVG_CH3G                 BIT(4)                                                     /*!< channel 3 capture or compare event generation */
#define TIMER_SWEVG_CMTG                 BIT(5)                                                     /*!< channel commutation event generation */
#define TIMER_SWEVG_TRGG                 BIT(6)                                                     /*!< trigger event generation */
#define TIMER_SWEVG_BRK0G                BIT(7)                                                     /*!< break 0 event generation */
#define TIMER_SWEVG_BRK1G                BIT(8)                                                     /*!< break 1 event generation */

/* TIMER_CHCTL0 */
/* output compare mode */
#define TIMER_CHCTL0_CH0MS               BITS(0,1)                                                  /*!< channel 0 mode selection */
#define TIMER_CHCTL0_CH0COMFEN           BIT(2)                                                     /*!< channel 0 output compare fast enable */
#define TIMER_CHCTL0_CH0COMSEN           BIT(3)                                                     /*!< channel 0 output compare shadow enable */
#define TIMER_CHCTL0_CH0COMCTL           (BITS(4,6) | BIT(16))                                      /*!< channel 0 output compare control  */
#define TIMER_CHCTL0_CH0COMCEN           BIT(7)                                                     /*!< channel 0 output compare clear enable */
#define TIMER_CHCTL0_CH1MS               BITS(8,9)                                                  /*!< channel 1 mode selection */
#define TIMER_CHCTL0_CH1COMFEN           BIT(10)                                                    /*!< channel 1 output compare fast enable */
#define TIMER_CHCTL0_CH1COMSEN           BIT(11)                                                    /*!< channel 1 output compare shadow enable */
#define TIMER_CHCTL0_CH1COMCTL           (BITS(12,14) | BIT(24))                                    /*!< channel 1 output compare control  */

