zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_timer.h
/* TIMER_CH3CV */
#define TIMER_CH3CV_CH3VAL               BITS(0,15)                                                 /*!< capture/compare value of channel 3 */

/* TIMER_CCHP */
#define TIMER_CCHP_DTCFG                 BITS(0,7)                                                  /*!< dead time configure */
#define TIMER_CCHP_PROT                  BITS(8,9)                                                  /*!< complementary register protect control */
#define TIMER_CCHP_IOS                   BIT(10)                                                    /*!< idle mode off-state configure */
#define TIMER_CCHP_ROS                   BIT(11)                                                    /*!< run mode off-state configure */
#define TIMER_CCHP_BRK0EN                BIT(12)                                                    /*!< break0 input signal enable */
#define TIMER_CCHP_BRK0P                 BIT(13)                                                    /*!< break0 input signal  polarity */
#define TIMER_CCHP_OAEN                  BIT(14)                                                    /*!< output automatic enable */
#define TIMER_CCHP_POEN                  BIT(15)                                                    /*!< primary output enable */
#define TIMER_CCHP_BRK0F                 BITS(16,19)                                                /*!< break0 input signal filter */
#define TIMER_CCHP_BRK1F                 BITS(20,23)                                                /*!< break1 input signal filter */
#define TIMER_CCHP_BRK1EN                BIT(24)                                                    /*!< break1 input signal enable */
#define TIMER_CCHP_BRK1P                 BIT(25)                                                    /*!< break1 input signal polarity */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,4)                                                  /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,12)                                                 /*!< DMA transfer count */

/* TIMER_DMATB */
#define TIMER_DMATB_DMATB                BITS(0,15)                                                 /*!< DMA transfer buffer address */

/* TIMER_CHCTL3 */
#define TIMER_CHCTL3_CH4COMFEN           BIT(2)                                                     /*!< channel 4 output compare fast enable */
#define TIMER_CHCTL3_CH4COMSEN           BIT(3)                                                     /*!< channel 4 output compare shadow enable */              
#define TIMER_CHCTL3_CH4COMCTL           (BITS(4,6) | BIT(16))                                      /*!< channel 4 output compare control  */
#define TIMER_CHCTL3_CH4COMCEN           BIT(7)                                                     /*!< channel 4 output compare clear enable */

/* TIMER_CH4CV */
#define TIMER_CH4CV_CH4VAL               BITS(0,15)                                                 /*!< capture/compare value of channel 4 */
#define TIMER_CH4CV_CCH4CH0              BIT(29)                                                    /*!< Combine Channel 4 and Channel 0 */ 
#define TIMER_CH4CV_CCH4CH1              BIT(30)                                                    /*!< Combine Channel 4 and Channel 1 */ 
#define TIMER_CH4CV_CCH4CH2              BIT(31)                                                    /*!< Combine Channel 4 and Channel 2 */ 

/* TIMER_AFCTL0 */
#define TIMER_AFCTL0_BRK0INEN           BIT(0)                                                     /*!< break0 BRKIN input enable */       
#define TIMER_AFCTL0_BRK0INP            BIT(9)                                                     /*!< break0 BRKIN input polarity */ 
#define TIMER_AFCTL0_ETISEL              BITS(14,17)                                                /*!< ETI source selection */       

/* TIMER_AFCTL1 */
#define TIMER_AFCTL1_BRK1INEN           BIT(0)                                                     /*!< break1 BRKIN input enable */       
#define TIMER_AFCTL1_BRK1INP            BIT(9)                                                     /*!< break1 BRKIN input polarity */ 

/* TIMER_INSEL */
#define TIMER_INSEL_CI0_SEL              BITS(0,3)                                                  /*!< CH0 input selection */
#define TIMER_INSEL_CI1_SEL              BITS(8,11)                                                 /*!< CH1 input selection */

/* TIMER_CFG */
#define TIMER_CFG_OUTSEL                 BIT(0)                                                     /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                                     /*!< write CHxVAL register selection */

/* constants definitions */
/* TIMER init parameter struct definitions */
typedef struct {
    uint16_t prescaler;                                                                             /*!< prescaler value */
    uint16_t alignedmode;                                                                           /*!< aligned mode */
    uint16_t counterdirection;                                                                      /*!< counter direction */
    uint32_t period;                                                                                /*!< period value */
    uint16_t clockdivision;                                                                         /*!< clock division value */
    uint16_t repetitioncounter;                                                                     /*!< the counter repetition value */
} timer_parameter_struct;

/* break parameter struct definitions */
typedef struct
{ 
    uint16_t runoffstate;                                                                           /*!< run mode off-state */
    uint16_t ideloffstate;                                                                          /*!< idle mode off-state */
    uint16_t deadtime;                                                                              /*!< dead time */
    uint16_t breakpolarity;                                                                         /*!< break polarity */
    uint16_t outputautostate;                                                                       /*!< output automatic enable */
    uint16_t protectmode;                                                                           /*!< complementary register protect control */
    uint32_t break0state;                                                                           /*!< BREAK0 input enable */
    uint32_t break0filter;                                                                          /*!< BREAK0 input filter */
    uint32_t break0polarity;                                                                        /*!< BREAK0 input polarity */
    uint32_t break1state;                                                                           /*!< BREAK1 input enable */
    uint32_t break1filter;                                                                          /*!< BREAK1 input filter */
    uint32_t break1polarity;                                                                        /*!< BREAK1 input polarity */
}timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct
{ 
    uint16_t outputstate;                                                                           /*!< channel output state */
    uint16_t outputnstate;                                                                          /*!< channel complementary output state */
    uint16_t ocpolarity;                                                                            /*!< channel output polarity */
    uint16_t ocnpolarity;                                                                           /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                                           /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                                          /*!< idle state of channel complementary output */
}timer_oc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct {
    uint16_t icpolarity;                                                                            /*!< channel input polarity */
    uint16_t icselection;                                                                           /*!< channel input mode selection */
    uint16_t icprescaler;                                                                           /*!< channel input capture prescaler */
    uint16_t icfilter;                                                                              /*!< channel input capture filter control */
} timer_ic_parameter_struct;

/* TIMER interrupt enable or disable */
#define TIMER_INT_UP                        TIMER_DMAINTEN_UPIE                                     /*!< update interrupt */
#define TIMER_INT_CH0                       TIMER_DMAINTEN_CH0IE                                    /*!< channel 0 interrupt */
#define TIMER_INT_CH1                       TIMER_DMAINTEN_CH1IE                                    /*!< channel 1 interrupt */
#define TIMER_INT_CH2                       TIMER_DMAINTEN_CH2IE                                    /*!< channel 2 interrupt */
#define TIMER_INT_CH3                       TIMER_DMAINTEN_CH3IE                                    /*!< channel 3 interrupt */
#define TIMER_INT_CMT                       TIMER_DMAINTEN_CMTIE                                    /*!< channel commutation interrupt flag */
#define TIMER_INT_TRG                       TIMER_DMAINTEN_TRGIE                                    /*!< trigger interrupt */
#define TIMER_INT_BRK                       TIMER_DMAINTEN_BRKIE                                    /*!< break interrupt */

/* TIMER flag */
#define TIMER_FLAG_UP                       TIMER_INTF_UPIF                                         /*!< update flag */
#define TIMER_FLAG_CH0                      TIMER_INTF_CH0IF                                        /*!< channel 0 flag */
#define TIMER_FLAG_CH1                      TIMER_INTF_CH1IF                                        /*!< channel 1 flag */
#define TIMER_FLAG_CH2                      TIMER_INTF_CH2IF                                        /*!< channel 2 flag */
#define TIMER_FLAG_CH3                      TIMER_INTF_CH3IF                                        /*!< channel 3 flag */
#define TIMER_FLAG_CH4                      TIMER_INTF_CH4IF                                        /*!< channel 3 flag */
#define TIMER_FLAG_CMT                      TIMER_INTF_CMTIF                                        /*!< channel commutation flag */
#define TIMER_FLAG_TRG                      TIMER_INTF_TRGIF                                        /*!< trigger flag */
#define TIMER_FLAG_BRK0                     TIMER_INTF_BRK0IF                                        /*!< break0 flag */
#define TIMER_FLAG_BRK1                     TIMER_INTF_BRK1IF                                        /*!< break0 flag */
#define TIMER_FLAG_CH0O                     TIMER_INTF_CH0OF                                        /*!< channel 0 overcapture flag */
#define TIMER_FLAG_CH1O                     TIMER_INTF_CH1OF                                        /*!< channel 1 overcapture flag */
#define TIMER_FLAG_CH2O                     TIMER_INTF_CH2OF                                        /*!< channel 2 overcapture flag */
#define TIMER_FLAG_CH3O                     TIMER_INTF_CH3OF                                        /*!< channel 3 overcapture flag */
#define TIMER_FLAG_SYSB                      TIMER_INTF_SYSBIF                                      /*!< system source break flag  */

/* TIMER interrupt flag */
#define TIMER_INT_FLAG_UP                   TIMER_INTF_UPIF                                         /*!< update interrupt flag */
#define TIMER_INT_FLAG_CH0                  TIMER_INTF_CH0IF                                        /*!< channel 0 interrupt flag */
#define TIMER_INT_FLAG_CH1                  TIMER_INTF_CH1IF                                        /*!< channel 1 interrupt flag */
#define TIMER_INT_FLAG_CH2                  TIMER_INTF_CH2IF                                        /*!< channel 2 interrupt flag */
#define TIMER_INT_FLAG_CH3                  TIMER_INTF_CH3IF                                        /*!< channel 3 interrupt flag */
#define TIMER_INT_FLAG_CMT                  TIMER_INTF_CMTIF                                        /*!< channel commutation interrupt flag */
#define TIMER_INT_FLAG_TRG                  TIMER_INTF_TRGIF                                        /*!< trigger interrupt flag */
#define TIMER_INT_FLAG_BRK0                 TIMER_INTF_BRK0IF                                       /*!< break 0 flag */
#define TIMER_INT_FLAG_BRK1                 TIMER_INTF_BRK1IF                                       /*!< break 1 flag */
#define TIMER_INT_FLAG_SYSB                 TIMER_INTF_SYSBIF                                       /*!< system source break interrupt flag  */

