zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_timer.h
/* BREAK0 input signal polarity */
#define TIMER_BREAK0_POLARITY_LOW           ((uint32_t)0x00000000U)                                 /*!< BREAK0 input signal polarity is low */
#define TIMER_BREAK0_POLARITY_HIGH          ((uint32_t)TIMER_CCHP_BRK0P)                            /*!< BREAK0 input signal polarity is high */

/* BREAK1 input signal enable */
#define TIMER_BREAK1_ENABLE                 ((uint32_t)TIMER_CCHP_BRK1EN)                           /*!< BREAK1 input signal enable */
#define TIMER_BREAK1_DISABLE                ((uint32_t)0x00000000U)                                 /*!< BREAK1 input signal disable */

/* BREAK1 input signal polarity */
#define TIMER_BREAK1_POLARITY_LOW           ((uint32_t)0x00000000U)                                 /*!< BREAK1 input signal polarity is low */
#define TIMER_BREAK1_POLARITY_HIGH          ((uint32_t)TIMER_CCHP_BRK1P)                            /*!< BREAK1 input signal polarity is high */

/* TIMER BREAK0/BREAK1 */
#define TIMER_BREAK0                        ((uint16_t)0x0000U)                                     /*!< TIMER BREAK0 */
#define TIMER_BREAK1                        ((uint16_t)0x0001U)                                     /*!< TIMER BREAK1 */

/* TIMER break input enable */
#define TIMER_BRKxINEN                      TIMER_AFCTL0_BRK0INEN                                   /*!< BREAKx BRKIN0 alternate function input enable */

/* TIMER external break input polarity */
#define TIMER_BRKxINP                       TIMER_AFCTL0_BRK0INP                                    /*!< BREAKx BRKIN0 polarity */

/* TIMER break external input polarity*/
#define TIMER_BRKIN_POLARITY_LOW            ((uint16_t)0x0000U)                                     /*!< TIMER break external input signal will not be inverted */
#define TIMER_BRKIN_POLARITY_HIGH           ((uint16_t)0x0001U)                                     /*!< TIMER break external input signal will be inverted */

/* TIMER channel n(n=0,2,13,15,16) */
#define TIMER_CH_0                          ((uint16_t)0x0000U)                                     /*!< TIMER channel 0(TIMERx(x=0,2,13,15,16)) */
#define TIMER_CH_1                          ((uint16_t)0x0001U)                                     /*!< TIMER channel 1(TIMERx(x=0,2)) */
#define TIMER_CH_2                          ((uint16_t)0x0002U)                                     /*!< TIMER channel 2(TIMERx(x=0,2)) */
#define TIMER_CH_3                          ((uint16_t)0x0003U)                                     /*!< TIMER channel 3(TIMERx(x=0,2)) */
#define TIMER_CH_4                          ((uint16_t)0x0004U)                                     /*!< TIMER channel 3(TIMERx(x=0)) */

/* channel enable state */
#define TIMER_CCX_ENABLE                    ((uint16_t)0x0001U)                                     /*!< channel enable */
#define TIMER_CCX_DISABLE                   ((uint16_t)0x0000U)                                     /*!< channel disable */

/* channel complementary output enable state */
#define TIMER_CCXN_ENABLE                   ((uint16_t)0x0004U)                                     /*!< channel complementary enable */
#define TIMER_CCXN_DISABLE                  ((uint16_t)0x0000U)                                     /*!< channel complementary disable */

/* channel combined 3 phase state */
#define TIMER_COMBINE_CHANNEL_ENABLE        ((uint16_t)0x0001U)                                     /*!< channel combined enable */
#define TIMER_COMBINE_CHANNEL_DISABLE       ((uint16_t)0x0000U)                                     /*!< channel combined disable */

/* channel output polarity */
#define TIMER_OC_POLARITY_HIGH              ((uint16_t)0x0000U)                                     /*!< channel output polarity is high */
#define TIMER_OC_POLARITY_LOW               ((uint16_t)0x0002U)                                     /*!< channel output polarity is low */

/* channel complementary output polarity */
#define TIMER_OCN_POLARITY_HIGH             ((uint16_t)0x0000U)                                     /*!< channel complementary output polarity is high */
#define TIMER_OCN_POLARITY_LOW              ((uint16_t)0x0008U)                                     /*!< channel complementary output polarity is low */

/* idle state of channel output */ 
#define TIMER_OC_IDLE_STATE_HIGH            ((uint16_t)0x0100)                                      /*!< idle state of channel output is high */
#define TIMER_OC_IDLE_STATE_LOW             ((uint16_t)0x0000)                                      /*!< idle state of channel output is low */

/* idle state of channel complementary output */
#define TIMER_OCN_IDLE_STATE_HIGH           ((uint16_t)0x0200U)                                     /*!< idle state of channel complementary output is high */
#define TIMER_OCN_IDLE_STATE_LOW            ((uint16_t)0x0000U)                                     /*!< idle state of channel complementary output is low */

/* channel output compare mode */
#define TIMER_OC_MODE_TIMING                ((uint32_t )0x00000000U)                                /*!< timing mode */
#define TIMER_OC_MODE_ACTIVE                ((uint32_t )0x00000010U)                                /*!!< active mode */
#define TIMER_OC_MODE_INACTIVE              ((uint32_t )0x00000020U)                                /*!!< inactive mode */
#define TIMER_OC_MODE_TOGGLE                ((uint32_t )0x00000030U)                                /*!!< toggle mode */
#define TIMER_OC_MODE_LOW                   ((uint32_t )0x00000040U)                                /*!!< force low mode */
#define TIMER_OC_MODE_HIGH                  ((uint32_t )0x00000050U)                                /*!!< force high mode */
#define TIMER_OC_MODE_PWM0                  ((uint32_t )0x00000060U)                                /*!!< PWM0 mode */
#define TIMER_OC_MODE_PWM1                  ((uint32_t )0x00000070U)                                /*!!< PWM1 mode*/
#define TIMER_OC_MODE_DELAYABLE_SPM0        ((uint32_t )0x00010000U)                                /*!!< Delayable SPM mode 0*/
#define TIMER_OC_MODE_DELAYABLE_SPM1        ((uint32_t )0x00010010U)                                /*!!< Delayable SPM mode 1*/
#define TIMER_OC_MODE_COMBINED_PWM0         ((uint32_t )0x00010040U)                                /*!!< Combined PWM mode 0 */
#define TIMER_OC_MODE_COMBINED_PWM1         ((uint32_t )0x00010050U)                                /*!!< Combined PWM mode 1*/
#define TIMER_OC_MODE_ASYMMETRIC_PWM0       ((uint32_t )0x00010060U)                                /*!!< Asymmetric PWM mode 0*/
#define TIMER_OC_MODE_ASYMMETRIC_PWM1       ((uint32_t )0x00010070U)                                /*!!< Asymmetric PWM mode 1*/

/* channel output compare shadow enable */
#define TIMER_OC_SHADOW_ENABLE              ((uint16_t)0x0008U)                                     /*!< channel output shadow state enable */
#define TIMER_OC_SHADOW_DISABLE             ((uint16_t)0x0000U)                                     /*!< channel output shadow state disable */

/* channel output compare fast enable */
#define TIMER_OC_FAST_ENABLE                ((uint16_t)0x0004)                                      /*!< channel output fast function enable */
#define TIMER_OC_FAST_DISABLE               ((uint16_t)0x0000)                                      /*!< channel output fast function disable */

